tap "goodwithtech/r"
tap "homebrew/bundle"
tap "homebrew/services"
tap "knqyf263/trivy"

brew "act"
brew "anyenv"
brew "autoconf"
brew "openssl@3"
brew "awscli"
brew "bash-completion"
brew "bison"
brew "bzip2"
brew "glib"
brew "cloc"
brew "colordiff"
brew "coreutils"
brew "cowsay"
brew "curl"
brew "diff-so-fancy"
brew "direnv"
brew "docker"
brew "docker-compose"
brew "gcc"
brew "gh"
brew "gibo"
brew "git"
brew "git-secrets"
brew "gobject-introspection"
brew "harfbuzz"
brew "pango"
brew "graphviz"
brew "grep"
brew "hadolint"
brew "hub"
brew "jq"
brew "krb5"
brew "lha"
brew "libedit"
brew "libiconv"
brew "libxml2"
brew "libzip"
brew "lua"
brew "mas"
brew "zlib"
brew "mysql"
brew "nghttp2"
brew "openssl@1.1"
brew "peco"
brew "pre-commit"
brew "protobuf@3"
brew "putty"
brew "pwgen"
brew "re2c"
brew "shellcheck"
brew "sl"
brew "ssh-copy-id"
brew "swagger-codegen"
brew "telnet"
brew "terraformer"
brew "tfenv"
brew "thefuck"
brew "tidy-html5"
brew "tree"
brew "vegeta"
brew "vim"
brew "wget"
brew "yq"

cask_args appdir: "/Applications"

cask "1password"
cask "azure-data-studio"
cask "cinebench"
cask "clipy"
cask "cyberduck"
cask "deepl"
cask "docker"
cask "fig"
cask "firefox"
cask "gather"
cask "google-cloud-sdk"
cask "google-chrome"
cask "google-japanese-ime"
cask "intellij-idea"
cask "iterm2"
cask "karabiner-elements"
cask "krisp"
cask "logitech-options"
cask "messenger"
cask "microsoft-auto-update"
cask "microsoft-office"
cask "parallels-client"
cask "postman"
cask "slack"
cask "visual-studio-code"
cask "wkhtmltopdf"
cask "xquartz"
cask "zoom"

mas "Display Menu", id: 549083868
mas "GarageBand", id: 682658836
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "LINE", id: 539883307
mas "Magnet", id: 441258766
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "RunCat", id: 1429033973
mas "TweetDeck", id: 485812721
mas "Xcode", id: 497799835
