cask_args appdir: "/Applications"
tap "homebrew/bundle"
tap "homebrew/core"
tap "homebrew/cask"

brew "anyenv"
brew "openssl"
brew "colordiff"
brew "coreutils"
brew "cowsay"
brew "curl"
brew "diff-so-fancy"
brew "direnv"
brew "gibo"
brew "git"
brew "git-secrets"
brew "hub"
brew "jq"
brew "libzip"
brew "mas"
brew "lua"
brew "peco"
brew "protobuf"
brew "sl"
brew "ssh-copy-id"
brew "thefuck"
brew "tree"
brew "vim"
brew "wget"
brew "awscli"
brew "bash-completion"

cask "clipy"
cask "cyberduck"
cask "docker-toolbox"
cask "google-japanese-ime"
cask "xquartz"
cask "iterm2"
cask "visual-studio-code"
cask "postman"
cask "intellij-idea"
cask "1password"
cask "google-chrome"
cask "firefox"
cask "zoom"
cask "karabiner-elements"
cask "virtualbox"
cask "microsoft-auto-update"
cask "microsoft-office"
cask "slack"
cask "parallels-client"
cask "cinebench"
cask "amazon-workspaces"

mas "Numbers", id: 409203825
mas "Monity", id: 915542151
mas "GarageBand", id: 682658836
mas "iMovie", id: 408981434
mas "Xcode", id: 497799835
mas "Display Menu", id: 549083868
mas "LINE", id: 539883307
mas "Magnet", id: 441258766
mas "TweetDeck", id: 485812721
mas "RunCat", id: 1429033973
